"""
# @Time: 2023年09月04日00:59
# @Author: orcakill
# @File: find_all.py
# @Description: 寻找数量
"""

from src.service.service_onmyoji_impl import current_exist
from src.utils.my_logger import my_logger as logger

if __name__ == '__main__':
	logger.debug("开始")
	current_list = [('技能', '柔风抱暖'), ('事件', '鏖战', '', 46.97205924987793), ('技能', '六道暴虐'),
	                ('技能', '六道暴虐'),
	                ('事件', '混沌', '精英', 110.73166251182556), ('事件', '鏖战', '', 47.87893795967102),
	                ('事件', '鏖战', '', 52.3708701133728), ('技能', '细雨化屏'),
	                ('事件', '星之屿', '', 125.08232498168945),
	                ('事件', '神秘', '技能转换', 19.762616395950317), ('技能', '妖力化身'),
	                ('事件', '鏖战', '', 67.74889516830444),
	                ('事件', '混沌', '幸运宝匣', 19.85278606414795), ('技能', '柔风抱暖'),
	                ('事件', '神秘', '背包仿造', 26.93778896331787), ('技能', '柔风抱暖'),
	                ('事件', '星之屿', '', 139.76848340034485),
	                ('事件', '混沌', '幸运宝匣', 19.8684241771698), ('事件', '神秘', '技能转换', 20.10395312309265),
	                ('技能', '柔风抱暖'), ('事件', '神秘', '背包仿造', 27.093019008636475), ('技能', '柔风抱暖'),
	                ('事件', '神秘', '背包仿造', 27.910119771957397), ('技能', '妖力化身'),
	                ('事件', '星之屿', '', 109.70919728279114),
	                ('技能', '细雨化屏'), ('事件', '鏖战', '', 74.20718193054199),
	                ('事件', '混沌', '幸运宝匣', 20.396320343017578),
	                ('事件', '宁息', '', 27.700333833694458), ('技能', '六道暴虐'),
	                ('事件', '鏖战', '', 40.1087965965271),
	                ('评价', '极'), ('事件', '月晓星征', '', 109.84239673614502)]
	s = current_exist(current_list, "评价", "极")
	logger.debug(s)
